Revit 2026 API

# ExportDGNSettingsSetDGNExportOptions Method

---

Sets the options stored in these settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDGNExportOptions(
	DGNExportOptions options
)
```
```vb
Public Sub SetDGNExportOptions (
	options As DGNExportOptions
)
```
```cpp
public:
void SetDGNExportOptions(
	DGNExportOptions^ options
)
```
```fsharp
member SetDGNExportOptions :
        options : DGNExportOptions -> unit
```

#### Parameters

options DGNExportOptions
     The options.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportDGNSettings Class

Autodesk.Revit.DB Namespace